"use client";
import Image from "next/image";
import Link from "next/link";
import { useParams } from "next/navigation";

const verses: { no: number; verse: string; title: string }[] = [
  {
    no: 1,
    verse: "သုတ္တံကျမ်း 4:18",
    title:
      "ဖြောင့်မတ်သောသူတို့၏လမ်းသည် တက်သော အာရုဏ်ကဲ့သို့ဖြစ်၍၊ နေထွက်သည်တိုင်အောင် တိုးပွါး ထွန်းလင်းတတ်၏။",
  },
  {
    no: 2,
    verse: "ဟေရှာယ 60:1",
    title:
      "သင်ထလော့။ လင်းလော့။ သင်၏အလင်း ရောက်လာပြီ။ ထာဝရဘုရား၏ဘုန်းတော်သည် သင်၏ အပေါ်မှာ ပေါ်ထွန်းလျက်ရှိ၏။",
  },
  {
    no: 3,
    verse: "မိက္ခာ 7:8",
    title:
      "အချင်းရန်သူ၊ ငါ့အပေါ်မှာ ဝါကြွားဝမ်းမြောက် ခြင်း မရှိနှင့်။ ငါလဲသော်လည်း ထဦးမည်။ မှောင်မိုက်၌ ထိုင်ရသော်လည်း၊ ထာဝရဘုရားသည် ငါ၏အလင်းဖြစ် တော်မူလိမ့်မည်။",
  },
  {
    no: 4,
    verse: "ဆာလံ 84:7",
    title:
      "သူတို့သည် အားတိုးတက်၍ ခရီးသွားလျက်၊ ဇိအုန်မြို့မှာ ဘုရားသခင့်ထံတော်၌ မျက်နှာပြကြပါ၏။",
  },
  {
    no: 5,
    verse: "ယောဘ 17:9",
    title:
      "ဖြောင့်မတ်သော သူတို့သည်လည်း တည်ကြည်ခြင်း၊ လက်စင်ကြယ်သောသူတို့သည် ခွန်အားတိုးပွါးခြင်း ရှိကြလိမ့်မည်။",
  },
  {
    no: 6,
    verse: "ဟေရှာယ 40:31",
    title:
      "ထာဝရဘုရားကို မြော်လင့်သောသူတို့မူကား၊ အားပြည့်ကြလိမ့်မည်။ ရွှေလင်းတကဲ့သို့ မိမိတို့ အတောင် ကို အသစ်ပြုပြင်ကြလိမ့်မည်။ ပြေးသော်လည်း မပင်ပန်း၊ ခရီးသွားသောအခါ မမောရကြ။",
  },
  {
    no: 7,
    verse: "ယောရှုသည် 1:9",
    title:
      "သင့်ကို ငါမှာထားသည်မဟုတ်လော။ အားယူ၍ ရဲရင့်ခြင်းရှိလော့။ မကြောက်နှင့်၊ စိတ်မပျက်နှင့်။ သွား လေရာရာ၌ သင်၏ဘုရားသခင် ထာဝရဘုရားရှိသည်ဟု မိန့်တော်မူ၏။",
  },
  {
    no: 8,
    verse: "ဆာလံ 18:39",
    title:
      "အကြောင်းမူကား၊ စစ်တိုက်ခြင်းငှါ ကိုယ် တော်သည် အကျွန်ုပ်ကို ခွန်အားခါးပန်းနှင့်စည်း၍၊ အကျွန်ုပ်တဘက်၌ ထသောသူတို့ကို အကျွန်ုပ်အောက်မှာ လှဲတော်မူ၏။",
  },
  {
    no: 9,
    verse: "ဖက် 6:10",
    title:
      "ကြွင်းသေးသော စကားဟူမူကား၊ ညီအစ်ကိုတို့၊ သခင်ဘုရားအားဖြင့်၎င်း၊ တန်ခိုးတော်အရှိန်အားဖြင့် ၎င်း၊ ခိုင်ခံ့ခြင်းရှိကြလော့။",
  },
  {
    no: 10,
    verse: "၂ တိမောသေ 2:1",
    title:
      "ငါ့သား၊ သင်သည် ယေရှုခရစ်၌ရှိသော ကျေးဇူးတော်အားဖြင့် ခိုင်ခံ့ခြင်းရှိလော့။",
  },
  {
    no: 11,
    verse: "၁ ကောရိန္သု 15:57",
    title:
      "ငါတို့သခင် ယေရှုခရစ်အားဖြင့် ငါတို့အား အောင်ခြင်းအခွင့်ကို ပေးတော်မူသော ဘုရားသခင်၏ ကျေးဇူးတော်သည် ကြီးလှစွတကား။",
  },
  {
    no: 12,
    verse: "ရောမ 8:37",
    title:
      "မကွာစေသည်သာမက၊ ငါတို့ကို ချစ်တော်မူသောသူ၏ ကျေးဇူးတော်ကြောင့်၊ ငါတို့သည် ထိုအမှု ခပ်သိမ်းတို့ကို ခံစဉ်တွင်ပင် အထူးသဖြင့် အောင်မြင်ကြ၏။",
  },
  {
    no: 13,
    verse: "၂ ကောရိန္သု 2:14",
    title:
      "ငါတို့သည် ခရစ်တော်နှင့်အတူ အောင်ပွဲကို အစဉ်ခံစေခြင်းငှါ၎င်း၊ ထိုသခင်ကို သိခြင်း၏ အမွှေး အကြိုင်သည် ငါတို့အားဖြင့် အရပ်ရပ်တို့၌ နှံ့ပြားစေခြင်းငှါ၎င်း၊ ပြုတော်မူသောဘုရားသခင်၏ ကျေးဇူးတော်ကို ချီးမွမ်းခြင်းရှိစေသတည်း။",
  },
  {
    no: 14,
    verse: "ဆာလံ 44:5",
    title:
      "ကိုယ်တော်အားဖြင့် အကျွန်ုပ်တို့သည် ရန်သူ များကို တွန်းချကြပါစေသော။ ရန်ဘက်ပြုသောသူတို့ကို နာမတော်အားဖြင့်နင်းရသော အခွင့်ရှိကြပါစေသော။",
  },
  {
    no: 15,
    verse: "ဗျာဒိတ်ကျမ်း 3:21",
    title:
      "ငါသည်အောင်မြင်၍ ငါ့ခမည်းတော်၏ ပလ္လင်တော်ပေါ်မှာ ခမည်းတော်နှင့်အတူထိုင်နေသကဲ့သို့၊ အောင်မြင်သော သူသည်ငါ၏ ပလ္လင်ပေါ်မှာ ငါနှင့်အတူ ထိုင်နေရသောအခွင့်ကိုငါပေးမည်။",
  },
  {
    no: 16,
    verse: "ဟေဗြဲ 12:1",
    title:
      "ထိုကြောင့်၊ ဤမျှလောက် များစွာသော သက်သေအပေါင်းတို့သည် ငါတို့ကို ဝိုင်းရံလျက်ရှိ ကြသည်ဖြစ်၍၊ ငါတို့သည် ခပ်သိမ်းသော ဝန်တို့ကို၎င်း၊ နှောင့်ရှက်တတ်သောဒုစရိုက်ကို၎င်း ပယ်ရှား၍၊ ငါတို့ မျက်မှောက်၌ ထားသောပန်းတုံးတိုင်သို့ရောက်ခြင်းငှါ၊ အားမလျော့ဘဲ ပြေးကြကုန်အံ့။",
  },
  {
    no: 17,
    verse: "၂ တိမောသေ 4:7",
    title:
      "ကောင်းစွာသော တိုက်လှန်ခြင်းကို ငါပြုပြီ။ ပြေးရသောလမ်းကို အဆုံးတိုင်အောင်ပြေးပြီ။ ယုံကြည် ခြင်းတရားကို စောင့်ရှောက်ပြီ။",
  },
  {
    no: 18,
    verse: "ဖိလိပ္ပိ 3:14",
    title:
      "ယေရှုခရစ်အားဖြင့်ဘုရားသခင်သည် အထက်အရပ်မှ ခေါ်တော်မူခြင်းနှင့် ဆိုင်သောဆုကို ရခြင်းငှါ၊ ပန်းတုံးတိုင်သို့ ငါလိုက်ပြေး၏။",
  },
  {
    no: 19,
    verse: "သုတ္တံကျမ်း 24:10",
    title: "သင်သည် အမှုရောက်သောကာလ၌ စိတ်ပျက် လျှင် အားနည်း၏။",
  },
  {
    no: 20,
    verse: "ကမ္ဘာ ဦး 12:2",
    title:
      "ငါသည် သင့်ကို လူမျိုးကြီးဖြစ်စေမည်။ ငါ ကောင်းကြီးပေး၍ သင်၏နာမကို ကြီးမြတ်စေမည်။ သင် သည် ကောင်းကြီးခံရသောသူ ဖြစ်လိမ့်မည်။",
  },
  {
    no: 21,
    verse: "မဿဲ 5:14",
    title:
      "သင်တို့သည် ဤလောက၏ အလင်းဖြစ်ကြ၏။ တောင်ထိပ်၌တည်သော မြို့ကို မကွယ်နိုင်။",
  },
  {
    no: 22,
    verse: "ဒံယေလ 11:32",
    title:
      "ပဋိညာဉ်တရားကို ပြစ်မှားသော သူတို့သည် ချော့မော့ရာသို့ လိုက်၍ ယိုယွင်းကြလိမ့်မည်။ မိမိတို့ ဘုရားသခင်ကို သိသောသူတို့မူကား၊ ကြီးစွာသောအားနှင့် ပြုကြလိမ့်မည်။",
  },
  {
    no: 23,
    verse: "သတာ 4:14",
    title:
      "ယခုကာလသင်သည် တိတ်ဆိတ်စွာနေလျှင်၊ သင်နှင့်သင်၏ အဆွေအမျိုးသည် ပျက်စီး၍၊ ယုဒလူတို့ အသက်ရှင်ခြင်း၊ ကယ်တင်ခြင်း အကြောင်းတစုံတခု ပေါ်လိမ့်မည်။ ယခုအမှုကိုဆောင်ဘို့ရာ သင်သည် မိဖုရားအရာကိုရသည်ဟု ထင်စရာရှိသည်မဟုတ်လော ဟု ဧသတာအား ပြန်ပြောစေခြင်းငှါ မှာလိုက်၏။",
  },
  {
    no: 24,
    verse: "ယေရမိ 1:5",
    title:
      "သင့်ကိုအမိဝမ်းထဲ၌ ငါမဖန်ဆင်းမှီသင့်ကို ငါသိပြီ။ မဘွားမှီကပင် သင့်ကို ငါသန့်ရှင်းစေ၍၊ လူ အမျိုးမျိုးတို့အဘို့၊ ပရောဖက်အရာ၌ ခန့်ထားပြီဟု မိန့်တော်မူ၏။",
  },
  {
    no: 25,
    verse: "ဆာလံ 92:12",
    title:
      "ဖြောင့်မတ်သောသူသည် စွန်ပလွံပင်ကဲ့သို့ ပွင့်လန်း၍ လေဗနုန်တောင်ပေါ်မှာ အာရဇ်ပင်ကဲ့သို့ ကြီးပွားလိမ့်မည်။",
  },
  {
    no: 26,
    verse: "ဟေရှာယ 54:2",
    title:
      "သင်၏တဲရာကို ကျယ်စေလော့။ သင်၏နေရာ မျက်နှာကြက်ကို ကြက်ဦးလော့။ နှမြောသော စိတ်မရှိ နှင့်။ ကြိုးတို့ကို ရှည်စေဦးလော့။ တိုင်တို့ကို မြဲစွာ စိုက် လော့။",
  },
  {
    no: 27,
    verse: "ယောဟန် 15:8",
    title:
      "သင်တို့သည် များစွာသောအသီးကိုသီးသောအားဖြင့်၊ ငါ့ခမည်းတော်သည် ဘုန်းထင်ရှားတော်မူ၍၊ သင်တို့သည်လည်း ငါ၏တပည့်မှန်ကြလိမ့်မည်။",
  },
  {
    no: 28,
    verse: "ကောလောသဲ 2:7",
    title:
      "ကျေးဇူးတော်ကို ချီးမွမ်းခြင်းနှင့်တကွ ယုံကြည်ခြင်း တိုးပွါးပြည့်စုံလျက်၊ ထိုသခင်၌ ကျင်လည်ကြလော့။",
  },
  {
    no: 29,
    verse: "၂ သက် 1:3",
    title:
      "ညီအစ်ကိုတို့၊ သင်တို့၏ယုံကြည်ခြင်းသည် အလွန်တိုးပွါး၍၊ လူတိုင်းအသီးသီးတို့သည် အချင်းချင်း ချစ်ခြင်းမေတ္တာနှင့် ပြည့်စုံကြသည်ဖြစ်၍ ငါတို့သည် ပြုသင့်သည်အတိုင်း သင်တို့ကြောင့် ဘုရားသခင်၏ ကျေးဇူးတော်ကို အစဉ်မပြတ်ချီးမွမ်းကြ၏။",
  },
  {
    no: 30,
    verse: "ဇာခရိ 4:6",
    title:
      "ကောင်းကင်တမန်ကလည်း၊ ဇေရုဗဗေလသို့ ရောက်လာသော ထာဝရဘုရား၏ နှုတ်ကပတ်တော်ဟူ မူကား၊ ဤအမှုသည် ဗိုလ်ခြေအားဖြင့်မဟုတ်၊ အာဏာ တန်ခိုးအားဖြင့်မဟုတ်၊ ငါ့ဝိညာဉ်အားဖြင့် ဖြစ်လိမ့်မည် ဟု ကောင်းကင်ဗိုလ်ခြေအရှင်ထာဝရဘုရား မိန့်တော် မူ၏။",
  },
  {
    no: 31,
    verse: "ဟေဗြဲ 11:33",
    title:
      "ထိုသူတို့သည် ယုံကြည်ခြင်းအားဖြင့် အခြားသောတိုင်းနိုင်ငံကိုအောင်ခြင်း၊ တရားသဖြင့် စီရင်ခြင်း၊ ဂတိတော်ကိုဝင်စားခြင်း၊ ခြင်္သေ့နှုတ်ကိုပိတ်ခြင်း၊မီးအရှိန်ကိုငြိမ်းစေခြင်း ထားလက်နက်ဘေးနှင့်ကင်းလွတ်ခြင်း၊ အနာမှထမြောက်၍ကျန်းမာခြင်း၊ စစ်တိုက်သောအခါ ခွန်အားနှင့်ပြည့်စုံခြင်း၊ တပါးအမျိုးသားတို့၏ တပ်များကို ဖျက်ဆီးခြင်းအမှုများကို ပြုကြ၏။",
  },
  {
    no: 32,
    verse: "ဆာလံ 27:1",
    title:
      "ထာဝရဘုရားသည် ငါ၏အလင်း၊ ငါ့ကို ကယ်တင်သော အရှင်ဖြစ်တော်မူ၏။ ငါသည် အဘယ် သူကို ကြောက်ရအံ့နည်း။ ထာဝရဘုရားသည် ငါ့၏ အသက်ခိုလှုံရာဖြစ်တော်မူ၏။ ငါသည် အဘယ်သူကိုမျှ ကြောက်လန့်ရအံ့နည်း။",
  },
  {
    no: 33,
    verse: "ရောမ 1:17",
    title:
      "အဘယ်သို့ဖြစ်သနည်းဟူမူကား၊ ဖြောင့်မတ် သောသူသည် ယုံကြည်ခြင်းအားဖြင့် အသက်ရှင်လိမ့်မည် ဟု ကျမ်းစာလာသည်နှင့်အညီ၊ ယုံကြည်ခြင်း၌ တည်သောဘုရားသခင်၏ ဖြောင့်မတ်ခြင်းတရားသည်၊ ယုံကြည်ခြင်းအဘို့အလိုငှါ ဧဝံဂေလိတရားအားဖြင့် ထင်ရှားလျက်ရှိ၏။",
  },
  {
    no: 34,
    verse: "မာကု 9:23",
    title:
      "ယေရှုကလည်း၊ သင်သည် ယုံကြည်နိုင်သလော။ ယုံကြည်သောသူဖြစ်လျှင် ခပ်သိမ်းသောအမှုတို့ကို တတ်နိုင်သည်ဟု မိန့်တော်မူ၏။",
  },
  {
    no: 35,
    verse: "မဿဲ 28:19",
    title:
      "သင်တို့သွား၍ လူမျိုးတကာတို့ကို ငါ့တပည့် ဖြစ်စေလျက်၊ ခမည်းတော်၊ သားတော်၊ သန့်ရှင်းသော ဝိညာဉ်တော်၏နာမ၌ ဗတ္တိဇံကို ပေးကြလော့။",
  },
  {
    no: 36,
    verse: "ဟေရှာယ 61:7",
    title:
      "သင်တို့အရှက်ကွဲခြင်းအရာ၌ နှစ်ဆသော အကျိုးကို ခံရ၍၊ အသရေပျက်ခြင်းအရာ၌လည်း၊ သူတို့ အဘို့ကို ခံစားလျက် ဝမ်းမြောက်ကြလိမ့်မည်။ သူတို့မြေ၌ နှစ်ဆသောအဘို့ကို အမွေခံရ၍၊ ထာဝရဝမ်းမြောက်ခြင်း နှင့် ပြည့်စုံကြလိမ့်မည်။",
  },
  {
    no: 37,
    verse: "ဟဗက္ကုတ် 2:14",
    title:
      "အကြောင်းမူကား၊ ပင်လယ်ရေသည် မိမိနေရာ ကို လွှမ်းမိုးသကဲ့သို့၊ မြေကြီးသည် ထာဝရဘုရား၏ ဘုန်း တော်ကို သိကျွမ်းခြင်းပညာနှင့် ပြည့်စုံလိမ့်မည်။",
  },
  {
    no: 38,
    verse: "ဆာလံ 110:3",
    title:
      "တန်ခိုးတော်ပြသော နေ့ရက်ကာလ၌၊ ကိုယ်တော်၏ လူတို့သည် သန့်ရှင်းသော တန်ဆာကို ဆင်လျက်၊ ကြည်ညိုသော စေတနာစိတ်ရှိ၍၊ လူပျိုတော် တို့သည် နံနက်ဝမ်းထဲကထွက်သော ဆီးနှင်းကဲ့သို့ ဖြစ်ကြပါလိမ့်မည်။",
  },
  {
    no: 39,
    verse: "၁ ဓမ္မရာဇဝင် 2:8",
    title:
      "ဆင်းရဲသောသူကို မြေမှုန့်ထဲက၎င်း၊ ငတ်မွတ်သောသူကို နောက်ချေးပုံထဲက၎င်း ချီးမြှောက်၍၊ မင်းသားတို့နှင့် ထိုင်ရသောအခွင့်၊ ဘုန်းကြီးသောပလ္လင်ကို အမွေခံရသောအခွင့်ကို ပေးတော်မူ၏။ အကြောင်းမူကား၊ မြေကြီးတိုင်တို့ကို ထာဝရဘုရားပိုင်၍ ထိုတိုင်တို့အပေါ်မှာ လောကဓာတ်ကို တည်တော်မူပြီ။",
  },
  {
    no: 40,
    verse: "၁ ကောရိန္သု 9:24",
    title:
      "မြေတလင်း၌ပြိုင်၍ ပြေးကြသောသူအပေါင်းတို့သည် ပြိုင်၍ ပြေးကြသော်လည်း၊ တယောက်တည်း သာလျှင် ဆုကိုရသည်ဟု သင်တို့ မသိကြသလော။ ဆုကို ရမည်အကြောင်း ပြေးကြလော့။",
  },
  {
    no: 41,
    verse: "ရှင်မာကု 16:17-18",
    title:
      "ယုံကြည်သောသူတို့၌ ဖြစ်အံ့သော နိမိတ်လက္ခဏာ ဟူမူကား၊ ငါ၏နာမကို အမှီပြု၍ နတ်ဆိုးတို့ကို နှင်ထုတ်ကြလတ္တံ့။ ထူးခြားသော ဘာသာစကားမျိုးတို့ကို ပြောကြလတ္တံ့။- မြွေတို့ကို ဖမ်းကိုင်ကြလတ္တံ့။ သေစေတတ်သော အဆိပ်အတောက်ကို သောက်စားလျှင် ဘေးဥပဒ်နှင့် ကင်းလွတ်ကြလတ္တံ့။ မကျန်းမမာသော သူတို့အပေါ်မှာ လက်ကိုတင်၍ ချမ်းသာပေးကြလတ္တံ့ဟု မိန့်တော်မူ၏။",
  },
  {
    no: 42,
    verse: "ရှင်မဿဲ 7:6",
    title:
      "ဖြူစင်သောအရာကို ခွေးတို့အား မပေးကြနှင့်။ ပုလဲရတနာတို့ကို ဝက်တို့ရှေ့မှာ မချမထားကြနှင့်။ သို့ပြုလျှင် ထိုအရာတို့ကို ကျော်နင်း၍ သင်တို့ကိုလှည့်လျက် ကိုက်ဖြတ်ကြလိမ့်မည်။-",
  },
  {
    no: 43,
    verse: "ရှင်ယောဟန် 14:12",
    title:
      "ငါအမှန်အကန်ဆိုသည်ကား၊ ငါ့ကိုယုံကြည်သောသူသည် ငါပြုသောအမှုတို့ကို ပြုလိမ့်မည်။ ထိုအမှုတို့ထက်သာ၍ ကြီးသောအမှုတို့ကိုလည်း ပြုလိမ့်မည်။",
  },
  {
    no: 44,
    verse: "ဇာခရိ 3:7 (က)",
    title:
      "သင်သည် ငါ့လမ်းသို့လိုက်၍ ငါ့ပညတ်တရားကို စောင့်ရှောက်လျှင်၊ ငါ့အိမ်ကို စီရင်ရသောအခွင့်၊ ငါ့ တံတိုင်းတို့ကို စောင့်ရသောအခွင့် ရှိလိမ့်မည်။",
  },
  {
    no: 45,
    verse: "ဟဂ္ဂဲ 2:5 (ခ)",
    title:
      "ငါ၏ဝိညာဉ်တော်သည် သင်တို့တွင် နေရာကျ၏။ မစိုးရိမ်ကြနှင့်ဟု၊ ကောင်းကင်ဗိုလ်ခြေအရှင် ထာဝရဘုရား မိန့်တော်မူ၏။",
  },
  {
    no: 46,
    verse: "မိက္ခာ 3:8",
    title:
      "ငါမူကား၊ ယာကုပ်အမျိုး လွန်ကျူးခြင်း၊ ဣသရေလအမျိုး ပြစ်မှားခြင်းကို သူတို့အား ဖော်ပြနိုင်မည်အကြောင်း၊ ထာဝရဘုရား၏ဝိညာဉ်တော်အားဖြင့် အရှိန်တန်ခိုး၊ ဉာဏ်သတ္တိ၊ အစွမ်းသတ္တိနှင့် ပြည့်စုံ၏။",
  },
  {
    no: 47,
    verse: "ဟဂ္ဂဲ 1:7",
    title:
      "ကောင်းကင်ဗိုလ်ခြေအရှင် ထာဝရဘုရား မိန့်တော်မူသည်ကား၊ ကိုယ်အကျင့်တို့ကို ဆင်ခြင်ကြလော့။",
  },
  {
    no: 48,
    verse: "ယောလ 2:28",
    title:
      "ထိုနောက်မှ လူမျိုးတကာတို့ အပေါ်သို့ ငါ၏ဝိညာဉ်တော်ကို ငါသွန်းလောင်းမည်။ သင်တို့၏ သားသမီးတို့သည် ပရောဖက်ဉာဏ်နှင့် ဟောပြောရကြလိမ့်မည်။ အသက်ကြီးသောသူတို့သည် နိမိတ်အိပ်မက်တို့ကို မြင်မက်ရကြလိမ့်မည်။ အသက်ငယ်သော သူတို့သည်လည်း ဗျာဒိတ်ရူပါရုံတို့ကို မြင်ရကြလိမ့်မည်။",
  },
  {
    no: 49,
    verse: "ယောလ 2:29",
    title:
      "ငါ၏အမှုကိုဆောင်ရွက်သော ယောက်ျားမိန်းမတို့အပေါ်သို့ ငါ၏ဝိညာဉ်တော်ကို ငါသွန်းလောင်း၍၊ သူတို့သည် ပရောဖက်ဉာဏ်နှင့် ဟောပြောရကြလိမ့်မည်။",
  },
  {
    no: 50,
    verse: "ယောလ 2:24",
    title:
      "ကောက်နယ်တလင်းတို့သည် စပါးနှင့်ပြည့်၍၊ အသီးနယ်ရာ ကျင်းတို့၌လည်း စပျစ်ရည်နှင့် ဆီ လျှံကြလိမ့်မည်။",
  },
  {
    no: 51,
    verse: "ဒံယေလ 11:32",
    title:
      "ပဋိညာဉ်တရားကို ပြစ်မှားသောသူတို့သည် ချော့မော့ရာသို့ လိုက်၍ ယိုယွင်းကြလိမ့်မည်။ မိမိတို့ ဘုရားသခင်ကို သိသောသူတို့မူကား၊ ကြီးစွာသောအားနှင့် ပြုကြလိမ့်မည်။",
  },
  {
    no: 52,
    verse: "၂ ကောရိန္သု 5:10",
    title:
      "အကြောင်းမူကား၊ ငါတို့ရှိသမျှသည် ကိုယ်ခန္ဓာ၌ကျင့်သောအကျင့်၊ ကောင်းမကောင်းရှိသည်အတိုင်း အကျိုးအပြစ်ကို အသီးအသီးခံခြင်းငှာ၊ ခရစ်တော်၏ တရားပလ္လင်ရှေ့၌ ပေါ်လာရကြမည်။",
  },
  {
    no: 53,
    verse: "တရားဟောရာ 28:7",
    title:
      "သင့်တစ်ဖက်၌ထသော ရန်သူတို့ကို သင့်မျက်မှောက်၌ ထာဝရဘုရားသည် ဒဏ်ခံစေတော်မူမည်။ သူတို့သည် တစ်လမ်းတည်းဖြင့် သင်ရှိရာသို့လာသော်လည်း၊ လမ်းခုနစ်သွယ်ဖြင့် သင့်ရှေ့မှပြေးကြလိမ့်မည်။",
  },
  {
    no: 54,
    verse: "ရှင်ယောဟန် 14:23",
    title:
      "ယေရှုကလည်း၊ ငါ့ကိုချစ်သောသူသည် ငါ့စကားကို နားထောင်လိမ့်မည်။ ငါ့ခမည်းတော်သည် ထိုသူကို ချစ်တော်မူသည်။ ငါတို့သည်လည်း၊ သူ့ဆီသို့ကြွ၍ နေရာချမည်။-",
  },
  {
    no: 55,
    verse: "ရှင်မာကု 9:23",
    title:
      "ယေရှုကလည်း၊ သင်သည် ယုံကြည်နိုင်သလော။ ယုံကြည်သောသူဖြစ်လျှင် ခပ်သိမ်းသောအမှုတို့ကို တတ်နိုင်သည်ဟု မိန့်တော်မူ၏။-",
  },
  {
    no: 56,
    verse: "ဧဖက် 4:28",
    title:
      "ခိုးတတ်သောသူသည် နောက်တစ်ဖန် မခိုးဘဲ၊ ဆင်းရဲသောသူအား ပေးကမ်းဝေငှရန် ရှိစေခြင်းငှာ၊ မိမိလက်နှင့် ကောင်းသောအလုပ်ကို လုပ်ဆောင်အားထုတ်စေ။-",
  },
  {
    no: 57,
    verse: "ရှင်မဿဲ 17:20",
    title:
      "သင်တို့သည် ယုံကြည်ခြင်းမရှိသောကြောင့် မနှင်ထုတ်နိုင်ကြ။ ငါအမှန်ဆိုသည်ကား၊ သင်တို့သည် မုန်ညင်းစေ့ခန့်မျှလောက်သော ယုံကြည်ခြင်းရှိလျှင်၊ ထိုတောင်ကို နေရာမှရွေ့လော့ဟု ဆိုကြသော်၊ နေရာမှ ရွေ့လိမ့်မည်။ ယုံကြည်ခြင်းရှိလျှင် သင်တို့မတတ်နိုင်သောအမှု မရှိ။-",
  },
  {
    no: 58,
    verse: "ရောမ 12:2",
    title:
      "သင်တို့သည် လောကီပုံသဏ္ဌာန်ကို မဆောင်ကြနှင့်။ ကောင်းမြတ်သောအရာ၊ နှစ်သက်ဖွယ်သောအရာ၊ စုံလင်သောအရာတည်းဟူသော ဘုရားသခင် အလိုတော်ရှိသောအရာသည် အဘယ်အရာဖြစ်သည်ကို သင်နိုင်မည်အကြောင်း၊ စိတ်နှလုံးကို အသစ်ပြင်ဆင်၍ ပုံသဏ္ဌာန်ပြောင်းလဲခြင်းသို့ ရောက်ကြလော့။-",
  },
  {
    no: 59,
    verse: "ဧဖက် 6:10",
    title:
      "ကြွင်းသေးသော စကားဟူမူကား၊ ညီအစ်ကိုတို့၊ သခင်ဘုရားအားဖြင့်လည်းကောင်း၊ တန်ခိုးတော်အရှိန် အားဖြင့်လည်းကောင်း၊ ခိုင်ခံ့ခြင်းရှိကြလော့။-",
  },
  {
    no: 60,
    verse: "၂ တိမောသေ 2:4",
    title:
      "စစ်သူရဲမည်သည်ကား၊ မိမိကိုစစ်သူရဲအရာ၌ ခန့်ထားသောသူကို နှစ်သက်စေခြင်းငှာ၊ လောကီမှု ရေးနှင့်ပြွမ်းနှောရှုပ်ထွေးခြင်းကို ပယ်ရှားတတ်၏။-",
  },
  {
    no: 61,
    verse: "ယေရမိ 1:7",
    title:
      "ထာဝရဘုရားကလည်း၊ အကျွန်ုပ်သည်သူငယ်ဖြစ်ပါ၏ဟု မပြောနှင့်။ အကြင်သူရှိရာသို့ သင့်ကိုငါစေလွှတ်၏။ ထိုသူရှိရာသို့ သင်သွားရမည်။ အကြင်စကားကို ငါမှာထား၏။ ထိုစကားကို သင်ဆင့်ဆိုရမည်။",
  },
  {
    no: 62,
    verse: "ဟေရှာယ 46:4",
    title:
      "သင်တို့အသက်ကြီး၍ ဆံပင်ဖြူသည်တိုင်အောင်၊ ငါသည် ထိုသို့သောသူဖြစ်၍၊ သင်တို့ကိုဆောင်ရွက်မည်။ ငါပြုခဲ့ပြီးသည်အတိုင်း ထမ်းဦးမည်။ ဆောင်ရွက်၍ ကယ်တင်မည်။",
  },
  {
    no: 63,
    verse: "ရှင်လုကာ 1:37",
    title: "ဘုရားသခင် တတ်နိုင်တော်မမူသောအမှု မရှိဟု ပြောဆိုလျှင်၊-",
  },
  {
    no: 64,
    verse: "ဆာလံ 34:13",
    title:
      "ကိုယ်လျှာကို မကောင်းသောအရာနှင့် ကင်းစေလော့။ နှုတ်ခမ်းလည်း မုသားစကားကို မပြောစေနှင့်။",
  },
  {
    no: 65,
    verse: "ရှင်ယာကုပ် 1:26",
    title:
      "သင်တို့တွင် အကြင်သူသည် သီလဆောက်တည် ဟန်ပြုသော်လည်း၊ မိမိနှုတ်ကို မချုပ်တည်း၊ မိမိနှလုံးကို လှည့်ဖြား၏။ ထိုသူ၏ သီလသည် အချည်းနှီးသက်သက် ဖြစ်၏။-",
  },
  {
    no: 66,
    verse: "ဒေသနာ3:7(ခ)",
    title: "တိတ်ဆိတ်စွာနေသောအချိန်နှင့်၊ စကားပြောရသော အချိန်လည်းရှိ၏။",
  },
  {
    no: 67,
    verse: "ရှင်ယာကုပ် 1:22",
    title:
      "ကိုယ်ကိုကိုယ်လှည့်ဖြား၍၊ နှုတ်ကပတ်တရားကို နာရုံမျှသာပြုသောသူ မဟုတ်၊ တရားကိုကျင့်သောသူ ဖြစ်ကြလော့။-",
  },
  {
    no: 68,
    verse: "ရှင်မဿဲ 13:12",
    title:
      "အကြင်သူသည် ရတတ်၏။ ထိုသူ၌ ကြွယ်ဝပြည့်စုံစေခြင်းငှာ ပေးဦးမည်။ အကြင်သူသည် ဆင်းရဲ၏။ ထိုသူ၌ရှိသမျှကိုပင် နုတ်လိမ့်မည်။-",
  },
  {
    no: 69,
    verse: "ရှင်မဿဲ 12:36",
    title:
      "ငါဆိုသည်ကား၊ လူတို့သည် အကျိုးမဲ့သောစကားကို ပြောသမျှအတွက်၊ တရားဆုံးဖြတ်သောနေ့၌ စစ်ကြောခြင်းကို ခံရကြလတ္တံ့။ သင့်စကားများအားဖြင့် သင်သည် အပြစ်လွတ်လိမ့်မည်။-",
  },
  {
    no: 70,
    verse: "ဧဖက် 6:8",
    title:
      "ကောင်းသောအကျင့်ကို ကျင့်သောသူ မည်သည်ကား၊ ကျွန်ဖြစ်စေ၊ လူလွတ်ဖြစ်စေ၊ သခင်ဘုရား၏ လက်တော်မှ အကျိုးကိုခံရလိမ့်မည်ဟု သိမှတ်ကြလော့။-",
  },
  {
    no: 71,
    verse: "ရှင်လုကာ 6:35",
    title:
      "သင်တို့မူကား ရန်သူတို့ကိုချစ်ကြလော့။ ကျေးဇူးပြုကြလော့။ တစ်စုံတစ်ခုကိုရမည်ဟု မျှော်လင့်ခြင်းမရှိဘဲ ချေးငှားကြလော့။ ထိုသို့ပြုလျှင် သင်တို့အကျိုးကြီးလိမ့်မည်။ အမြင့်ဆုံသောဘုရား၏သား ဖြစ်ကြလိမ့်မည်။-",
  },
  {
    no: 72,
    verse: "ဗျာဒိတ် 22:12",
    title:
      "ငါသည် အလျင်အမြန်လာမည်။ ငါသည် အကျိုးအပြစ်ကို ဆောင်ခဲ့သည်ဖြစ်၍၊ လူအသီးအသီးတို့အား မိမိတို့အကျင့်အတိုင်း ဆပ်ပေးမည်။-",
  },
  {
    no: 73,
    verse: "ဟေရှာယ 30:21",
    title:
      "သင်သည် လက်ယာဘက်၊ လက်ဝဲဘက်သို့ လမ်းလွဲလျှင်၊ ဤမည်သောလမ်းသည် မှန်၏။ ဤလမ်း၌သွားလော့ဟု သင့်နောက်၌ ပြောသောစကားသံကို ကိုယ်နားနှင့် ကြားရလိမ့်မည်။",
  },
  {
    no: 74,
    verse: "ဆာလံ 146:3",
    title: "မင်းများမှစ၍ မကယ်တင်နိုင်သော လူသားကို မကိုးစားကြနှင့်။",
  },
  {
    no: 75,
    verse: "ထွက်မြောက်ရာ 15:26",
    title:
      "သင်တို့သည် သင်တို့၏ ဘုရားသခင်ထာဝရဘုရား၏စကားကို စေ့စေ့နားထောင်၍ နှစ်သက်တော်မူသောအကျင့်ကို ကျင့်လျှင်လည်းကောင်း၊ ပညတ်တရားတော်အလိုသို့လိုက်၍ စီရင်တော်မူချက်တို့ကို စောင့်ရှောက်လျှင်လည်းကောင်း၊ ငါသည် အဲဂုတ္တုလူတို့၌စွဲစေသော ရောဂါတစ်စုံတစ်ခုကိုမျှ သင်တို့၌မစွဲစေ။ ငါသည် သင်တို့၏ရောဂါကိုငြိမ်းစေသော ထာဝရဘုရားဖြစ်သည်ဟု မိန့်တော်မူ၏။",
  },
  {
    no: 76,
    verse: "ယေရမိ 30:17",
    title:
      "ထာဝရဘုရား မိန့်တော်မူသည်ကား၊ သူတစ်ပါးတို့က၊ သင်သည် စွန့်ပစ်ခြင်းကို ခံရသောသူဟူ၍လည်းကောင်း၊ အဘယ်သူမျှ မကြည့်ရှု မပြုစုသော ဇိအုန်မြို့ဟူ၍လည်းကောင်းခေါ်သော်လည်း၊ သင်၏အနာရောဂါများကိုငါပျောက်စေ၍၊ ကျန်းမာပကတိ ဖြစ်စေမည်။",
  },
  {
    no: 77,
    verse: "သုတ္တံ 4:20-21",
    title:
      "ငါ့သား၊ ငါ့စကားကိုနားထောင်လော့။ ငါဟောပြောချက်တို့ကို နားသွင်းလော့။ သင့်မျက်မှောက်မှ မကွာစေနှင့်။ နှလုံးတွင်း၌ စောင့်ထားလော့။",
  },
  {
    no: 78,
    verse: "သုတ္တံ 21:23",
    title:
      "မိမိနှုတ်နှင့်လျှာကို စောင့်သောသူသည် မိမိစိတ်ဝိညာဉ်ကို ဒုက္ခနှင့်လွတ်စေခြင်းငှာ စောင့်ရာရောက်၏။",
  },
  {
    no: 79,
    verse: "သုတ္တံ 15:13",
    title:
      "ရွှင်လန်းသောစိတ်နှလုံးသည် ချိုသောမျက်နှာကို ဖြစ်စေတတ်၏။ ညှိုးငယ်ခြင်းအားဖြင့်ကား၊ စိတ်ပျက်တတ်၏။",
  },
  {
    no: 80,
    verse: "သုတ္တံ 6:24",
    title:
      "ဆိုးသော မိန်းမနှင့်လည်းကောင်း၊ အမျိုးပျက်သောမိန်းမ ချော့မော့တတ်သောနှုတ်နှင့်လည်းကောင်း လွတ်စေခြင်းငှာ၊ သင့်ကိုစောင့်ဖို့ရာ ဖြစ်သတည်း။",
  },
  {
    no: 81,
    verse: "သုတ္တံ 28:22",
    title:
      "ငွေရတတ်ခြင်းငှာ အလျင်အမြန်ပြုသောသူသည် မနာလိုသောသဘောရှိတတ်၏။ နောက်တစ်ဖန် ဆင်းရဲခြင်းသို့ ရောက်မည်ဟု မအောက်မေ့တတ်။",
  },
  {
    no: 82,
    verse: "ဟေရှာယ 7:10",
    title:
      "တစ်ဖန် ထာဝရဘုရားက၊ သင်၏ဘုရားသခင် ထာဝရဘုရားထံမှာ နိမိတ်လက္ခဏာကို တောင်းပန်လော့။",
  },
  {
    no: 83,
    verse: "တရားဟောရာ 8:18",
    title:
      "သင်၏ ဘုရားသခင်ထာဝရဘုရားကိုသာ အောက်မေ့ရမည်။ အကြောင်းမူကား၊ သင်၏ဘိုးဘေးတို့အား ကျိန်ဆိုတော်မူသော ပဋိညာဉ်တရားတော်ကို ယနေ့ကဲ့သို့ တည်စေလိုသောငှာ၊ စည်းစိမ်ရတတ်သော အစွမ်းသတ္တိကို ဘုရားသခင်ပေးတော်မူ၏။",
  },
  {
    no: 84,
    verse: "ဂလာတိ 6:9",
    title:
      "ငါတို့သည်အားမလျော့၊ စိတ်မပျက်ဘဲ ကောင်းသောအကျင့်ကို ကျင့်ကြကုန်အံ့။ ထိုသို့တည်ကြည်၍ ကျင့်လျှင် အချိန်တန်သောကာလ၌ အသီးအနှံကို ရိတ်ရကြလိမ့်မည်။-",
  },
  {
    no: 85,
    verse: "ယောရှု 1:8",
    title:
      "ထိုပညတ္တိကျမ်းစာ၌ ရေးထားသမျှအတိုင်းကျင့်မည်ဟု စောင့်ရှောက်ခြင်းအလိုငှာ ကျမ်းစာကို မဖတ်မရွတ်ဘဲမနေ၊ နေ့ညမပြတ် ကြည့်ရှုဖတ်ရွတ်ရမည်။ သို့ပြုလျှင် သင်သည်အကြံထမြောက်၍ အောင်မြင်လိမ့်မည်။",
  },
  {
    no: 86,
    verse: "ဟေဗြဲ 6:12",
    title:
      "ယုံကြည်ခြင်းနှင့် သည်းခံခြင်းအားဖြင့် ကတိတော်တို့ကို အမွေခံရသောသူတို့နည်းတူ ကျင့်နိုင်မည်အကြောင်း၊ ထိုသို့သော လုံ့လဝိရိယကို ထုတ်၍၊ အဆုံးတိုင်အောင် ယုံမှားခြင်းနှင့် ကင်းသော မျှော်လင့်ခြင်းနှင့် ပြည့်စုံစေခြင်းငှာ ငါတို့သည် အလိုရှိကြ၏။",
  },
  {
    no: 87,
    verse: "ရှင်မဿဲ 11:25",
    title:
      "ထိုအခါ ယေရှုက၊ ကောင်းကင်နှင့် မြေကြီးကို အစိုးရတော်မူသောအဘ၊ ကိုယ်တော်သည် ပညာအလိမ္မာနှင့် ပြည့်စုံသောသူတို့အား ဤအရာများကို ထိမ်ဝှက်ကွယ်ထားလျက် သူငယ်တို့အား ဖော်ပြတော်မူသည်ဖြစ်၍၊ ကျေးဇူးတော်ကို အကျွန်ုပ် ချီးမွမ်းပါ၏။-",
  },
  {
    no: 88,
    verse: "ယေရမိ 17:7",
    title:
      "ထာဝရဘုရားကို ကိုးစားသောသူ၊ ထာဝရဘုရားကို မိမိကိုးစားရာ အကြောင်းဖြစ်စေသောသူသည် ကောင်းချီးမင်္ဂလာကို ခံအပ်သောသူဖြစ်၏။",
  },
  {
    no: 89,
    verse: "ရှင်မဿဲ 21:22",
    title:
      "ယုံကြည်ခြင်းပါလျက် ပတ္ထနာပြု၍ ဆုတောင်းသမျှတို့ကို သင်တို့သည် ရကြလိမ့်မည်ဟု မိန့်တော်မူ၏။",
  },
  {
    no: 90,
    verse: "ဟေဗြဲ 10:23",
    title:
      "မျှော်လင့်ခြင်းအကြောင်းကို ဝန်ခံ၍ မတိမ်းယိမ်းမရွေ့လျော့ဘဲ တည်ကြည်ကြကုန်အံ့။ အကြောင်းမူကား၊ ကတိထားတော်မူသော သူသည် သစ္စာနှင့် ပြည့်စုံတော်မူ၏။-",
  },
  {
    no: 91,
    verse: "ဆာလံ 145:20",
    title:
      "ထာဝရဘုရားသည် ကြည်ညိုသူအပေါင်းတို့ကို စောင့်မတော်မူ၏။ မတရားသောသူအပေါင်းတို့ကိုကား၊ ဖျက်ဆီးတော်မူမည်။",
  },
  {
    no: 92,
    verse: "သုတ္တံ 28:27",
    title:
      "ဆင်းရဲသားတို့အား စွန့်ကြဲသောသူသည် ကိုယ်တိုင်မဆင်းရဲရာ။ လွှဲရှောင်သောသူမူကား၊ များစွာသောကျိန်ဆဲခြင်းကို ခံရလိမ့်မည်။",
  },
  {
    no: 93,
    verse: "ရှင်လုကာ 6:30",
    title:
      "အကြင်သူသည် သင့်ကိုတောင်း၏။ ထိုသူအား ပေးလော့။ သင့်ဥစ္စာကို သိမ်းယူသောသူအား ပြန်၍မတောင်းနှင့်။-",
  },
  {
    no: 94,
    verse: "တရားဟောရာ 4:31",
    title:
      "သင်တို့၏ဘုရားသခင် ထာဝရဘုရားသည် သနားတတ်သောဘုရား ဖြစ်တော်မူသောကြောင့် သင်တို့ကို စွန့်ပစ်ဖျက်ဆီးတော်မမူ။ သင်တို့ဘိုးဘေးတို့အား ကျိန်ဆိုတော်မူသောပဋိညာဉ်တရားကို မေ့လျော့တော်မမူ။",
  },
  {
    no: 95,
    verse: "ဆာလံ 27:10",
    title:
      "ကိုယ်မိဘတို့သည် အကျွန်ုပ်ကိုစွန့်သော်လည်း၊ ထာဝရဘုရားသည် အကျွန်ုပ်ကို ချီယူတော်မူမည်။",
  },
  {
    no: 96,
    verse: "ဟေဗြဲ 12:28",
    title:
      "ထိုကြောင့်၊ ငါတို့သည် မလှုပ်နိုင်သောနိုင်ငံကို ရသည်ဖြစ်၍၊ ခန့်ညားကြောက်ရွံ့သောသဘောနှင့် ဘုရားသခင်ကို လျောက်ပတ်စွာ ဝတ်ပြုနိုင်မည်အကြောင်း၊ ကျေးဇူးတော်ကို စွဲလမ်းကြကုန်အံ့။-",
  },
  {
    no: 97,
    verse: "ရှင်မဿဲ 28:20",
    title:
      "ငါသည် သင်တို့အား ပေးသမျှသော ပညတ်တော်တို့ကို စောင့်ရှောက်စေခြင်းငှာ ဆုံးမဩဝါဒပေးကြလော့။ ငါသည်လည်း ကပ်ကမ္ဘာကုန်သည်တိုင်အောင် သင်တို့နှင့်အတူ အစဉ်မပြတ် ရှိသည်ဟု တပည့်တော်တို့အား မိန့်တော်မူ၏။",
  },
  {
    no: 98,
    verse: "ဟေဗြဲ 10:25 (ခ)",
    title:
      "လူအချို့တို့၏ ထုံးစံရှိသည်အတိုင်း၊ အချင်းချင်း စည်းဝေးခြင်းအမှုကို မရှောင်မလွှဲကြနှင့်။ အချင်းချင်းတို့ကို တိုက်တွန်းနှိုးဆော်ကြလော့။",
  },
  {
    no: 99,
    verse: "ဟေဗြဲ 10:24",
    title:
      "ထိုမှတစ်ပါး မေတ္တာစိတ်ရှိစေခြင်းငှာလည်းကောင်း၊ ကောင်းသောအကျင့်ကို ကျင့်စေခြင်းငှာလည်းကောင်း၊ တိုက်တွန်း နှိုးဆော်ရသောအခွင့်ကို ရှာ၍၊ အချင်းချင်း တစ်ယောက်ကိုတစ်ယောက် ထောက်စာကြည့်ရှုကြကုန်အံ့။-",
  },
  {
    no: 100,
    verse: "ဟေဗြဲ 6:14",
    title:
      "ငါသည်သင့်အား အစဉ်အမြဲကောင်းချီးပေးမည်။ သင့်ကို အစဉ်အမြဲပွားများစေမည်ဟု ကျိန်ဆိုတော်မူ၏။-",
  },
  {
    no: 101,
    verse: "ဟေဗြဲ 3:7-8",
    title:
      "ထိုကြောင့်၊ သန့်ရှင်းသောဝိညာဉ်တော် မိန့်တော်မူသည်ကား၊ ယနေ့တွင် သင်တို့သည် ဗျာဒိတ်တော်အသံကို ကြားလျက် ရှိသည်ဖြစ်၍၊- ခိုင်မာသော စိတ်နှလုံးမရှိကြနှင့်။",
  },
  {
    no: 102,
    verse: "တိတု 2:7 (က)",
    title: "အရာရာ၌ ကောင်းသောအကျင့်တို့၏ ပုံသက်သေကို ကိုယ်တိုင်ပြလော့။",
  },
  {
    no: 103,
    verse: "ဟေဗြဲ 2:1",
    title:
      "ထိုကြောင့်၊ ငါတို့သည် ကြားရသော ဒေသနာတော်ကို မမေ့မလျော့မည်အကြောင်း၊ စိတ်နှလုံး၌သာ၍မှတ်မိစွဲလမ်းခြင်း ရှိရကြမည်။-",
  },
  {
    no: 104,
    verse: "၂ တိမောသေ 4:2",
    title:
      "နှုတ်ကပတ်တရားတော်ကို ဟောပြောလော့။ အချိန်ရှိသည်ဖြစ်စေ၊ မရှိသည်ဖြစ်စေ၊ ကြိုးစားအားထုတ်လော့။ အပြစ်ကို ဖော်ပြလော့။ ဆုံးမခြင်းကိုပြုလော့။ အလွန်ရှည်သောစိတ်နှင့် ဩဝါဒမျိုးကိုပေး၍ တိုက်တွန်းသွေးဆောင်လော့။-",
  },
  {
    no: 105,
    verse: "၂ သက်သာလောနိတ် 2:3",
    title:
      "အဘယ်သူမျှ သင်တို့ကို အဘယ်သို့သောအားဖြင့် မလှည့်ဖြားစေနှင့်၊ ထိုနေ့ရက်မရောက်မီ ဖောက်ပြန်သင်းခွဲခြင်းသည် အရင်ဖြစ်၍၊ ဒုစရိုက်လူတည်းဟူသော ပျက်စီးခြင်း၏သားသည် ပေါ်လာရလိမ့်မည်။-",
  },
  {
    no: 106,
    verse: "၁ သက်သာလောနိတ် 4:3-4",
    title:
      "ဘုရားသခင်၏ အလိုတော်ဟူမူကား၊ သင်တို့သည် မတရားသောမေထုန်ကို ကြဉ်ရှောင်၍ သန့်ရှင်းစေခြင်းငှာလည်းကောင်း၊- ဘုရားသခင်ကိုမသိသော သာသနာပလူတို့သည် ကိလေသာ တပ်မက်ခြင်းရှိသကဲ့သို့ မရှိ၊-",
  },
  {
    no: 107,
    verse: "၁ သက်သာလောနိတ် 5:8(က)",
    title: "နေ့၏သားဖြစ်သော ငါတို့မူကား၊ သမ္မာသတိရှိကြကုန်အံ့။",
  },
  {
    no: 108,
    verse: "ကောလောသဲ 4:6",
    title:
      "လူအသီးအသီးတို့အား အဘယ်သို့ ပြန်ပြောရမည်ကို သိနိုင်မည်အကြောင်း၊ သင်တို့စကားသည် ဆားအားဖြင့် ငန်သောအရသာနှင့် ပြည့်စုံလျက်၊ အစဉ်မပြတ် တင့်တယ်လျောက်ပတ်ပါစေ။",
  },
  {
    no: 109,
    verse: "ကောလောသဲ 3:23",
    title:
      "လူ၏အမှုကိုသာ ဆောင်ရွက်သကဲ့သို့မဟုတ်၊ သခင်ဘုရား၏ အမှုတော်ကို ဆောင်ရွက်သကဲ့သို့၊ ပြုလေသမျှတို့၌ စေတနာစိတ်နှင့် ပြုကြလော့။-",
  },
  {
    no: 110,
    verse: "ကောလောသဲ 4:2",
    title:
      "ဆုတောင်းပတ္ထနာပြုခြင်းအမှုကို အမြဲပြု၍၊ ကျေးဇူးတော်ကို ချီးမွမ်းလျက် စောင့်ရှောက်ကြလော့။-",
  },
  {
    no: 111,
    verse: "ကောလောသဲ 3:2",
    title:
      "မြေကြီးပေါ်မှာရှိသော အရာတို့ကို စွဲလမ်းသောစိတ် မရှိကြနှင့်။ အထက်အရာတို့ကိုသာ စိတ်စွဲလမ်းခြင်း ရှိကြလော့။-",
  },
  {
    no: 112,
    verse: "ဖိလိပ္ပိ 4:5",
    title:
      "လူအပေါင်းတို့ရှေ့၌ သင် တို့၏ ဖြည်းညင်းခြင်း သဘောကို ထင်ရှားစေကြလော့။ သခင်ဘုရားသည် အနီးအပါး၌ ရှိတော်မူ၏။-",
  },
  {
    no: 113,
    verse: "ဖိလိပ္ပိ 4:8",
    title:
      "ကြွင်းသေးသော စကားဟူမူကား၊ ညီအစ်ကိုတို့၊ သမ္မာတရားနှင့် ဆိုင်သောအကျင့်၊ လျောက်ပတ်သော အကျင့်၊ ဖြောင့်မတ်သော အကျင့်၊ စင်ကြယ်သော အကျင့်၊ သူတပါးနှစ်သက်ဖွယ်သော အကျင့်၊ ချီးမွမ်းဖွယ်သောအကျင့် ရှိသမျှတို့ကိုလည်းကောင်း၊ ပါရမီတစ်ပါးပါး၊ ကောင်းသော သတင်းတစ်ပါးပါးနှင့် ဆိုင်သောအကျင့်တို့ကိုလည်းကောင်း၊ နှလုံးသွင်းကြလော့။-",
  },
  {
    no: 114,
    verse: "ဖိလိပ္ပိ 4:4",
    title:
      "သခင်ဘုရား၌ အစဉ်မပြတ် ဝမ်းမြောက်ခြင်းရှိကြလော့။ တစ်ဖန် ငါဆိုသည်ကား ဝမ်းမြောက်ကြလော့။-",
  },
  {
    no: 115,
    verse: "၁ တိမောသေ 4:15",
    title:
      "သင်၏တိုးပွားခြင်းကို လူအပေါင်းတို့အား ထင်ရှားစေခြင်းငှာ၊ ဤအရာများကို စိတ်စွဲလမ်း၍ ကြိုးစားအားထုတ်လော့။-",
  },
  {
    no: 116,
    verse: "ဗျာဒိတ် 1:3",
    title:
      "ကာလအချိန် ရောက်လုနီးပြီဖြစ်၍၊ ဤအနာဂတ္တိကျမ်းစကားကို ကြည့်ရှုဖတ်ရွတ် နားထောင်၍၊ ရေးထားသမျှတို့ကို စောင့်ရှောက်သောသူတို့သည် မင်္ဂလာရှိကြ၏။",
  },
  {
    no: 117,
    verse: "၁ တိမောသေ 5:4",
    title:
      "သားမြေးရှိသော မုဆိုးမဖြစ်လျှင်၊ ထိုသားမြေးတို့သည် ရှေ့ဦးစွာ ဘုရားဝတ်ကို ရည်မှတ်လျက်၊ မိမိအိမ်ကို ပြုစု၍ မိဘဘိုးဘွား၌ ကျေးဇူးဆပ်ခြင်းငှာ သင်ကြစေ။ ထိုအမှုသည် ဘုရားသခင်နှစ်သက်တော်မူသောအမှုဖြစ်၏။-",
  },
  {
    no: 118,
    verse: "ရှင်ယောဟန် 7:38",
    title:
      "ငါ့ကိုယုံကြည်သောသူသည် ကျမ်းစာလာသည်အတိုင်း အသက်ရေထွက်ရာ စမ်းရေတွင်းဖြစ်လိမ့်မည်ဟု မိန့်တော်မူ၏။-",
  },
  {
    no: 119,
    verse: "ရှင်ယောဟန် 4:34",
    title:
      "ယေရှုက၊ ငါ့ကိုစေလွှတ်တော်မူသောသူ၏ အလိုတော်ကိုဆောင်ခြင်း၊ သူ၏အမှုတော်ကို ပြီးစီးခြင်းအမှုသည် ငါ့စားစရာဖြစ်၏။-",
  },
  {
    no: 120,
    verse: "ဟေရှာယ 29:13",
    title:
      "ထာဝရဘုရားကလည်း၊ ဤလူမျိုးသည် နှုတ်နှင့် ငါ့ထံသို့ ချဉ်းကပ်၍၊ နှုတ်ခမ်းနှင့် ငါ့ကိုရိုသေကြ၏။ စိတ်နှလုံးမူကား ငါနှင့် ဝေးလှ၏။ လူတို့စီရင်သော ပညတ်တို့ကို အမှီပြု၍ ငါ့ကိုကြောက်ရွံ့ကြ၏။",
  },
  {
    no: 121,
    verse: "ဟေရှာယ 49:17",
    title:
      "သင်၏သားသမီးတို့သည် အလျင်အမြန် ပြုကြလိမ့်မည်။ သင့်ကို လုယူဖျက်ဆီးသော သူတို့သည် သင့်ထံမှ ထွက်သွားကြလိမ့်မည်။",
  },
  {
    no: 122,
    verse: "ဟေရှာယ 44:3(ခ)",
    title:
      "သင်၏ အမျိုးအပေါ်မှာ ငါ့ဝိညာဉ်ကိုလည်းကောင်း၊ သင်၏အနွယ်အပေါ်မှာ ငါ့ကောင်းချီးမင်္ဂလာကိုလည်းကောင်း ငါသွန်းလောင်းမည်။",
  },
  {
    no: 123,
    verse: "ဟေရှာယ 10:27",
    title:
      "ထိုကာလ၌ သူ၏ဝန်ကို သင်၏ပခုံးပေါ်ကလည်းကောင်း၊ သူ၏ထမ်းပိုးကို သင်၏လည်ပင်းပေါ်ကလည်းကောင်းချရ၏။ ဆူဝခြင်းကျေးဇူးကြောင့် ထမ်းပိုးပျက်စီးရ၏။",
  },
  {
    no: 124,
    verse: "ဟေရှာယ 1:19",
    title: "သင်တို့သည် ကြည်ညိုနားထောင်လျှင်၊ မြေအသီးအနှံကို စားရကြလိမ့်မည်။",
  },
  {
    no: 125,
    verse: "သုတ္တံ 25:9(ခ)",
    title: "ဝှက်ထားအပ်သောအမှုအရာကို သူတစ်ပါးအား ထုတ်၍မပြနှင့်။",
  },
  {
    no: 126,
    verse: "သုတ္တံ 27:2",
    title:
      "ကိုယ်တိုင်ကိုယ်ကို မချီးမွမ်းဘဲ သူတစ်ပါးချီးမွမ်းပါလေစေ။ ကိုယ်နှုတ်နှင့် ကိုယ်ကိုမချီးမွမ်းဘဲ၊ ကိုယ်နှင့်မဆိုင်သော သူတစ်ပါး ချီးမွမ်းပါလေစေ။",
  },
  {
    no: 127,
    verse: "သုတ္တံ 17:9",
    title:
      "သူတစ်ပါးပြစ်မှားသော အမှုကို ဝှက်ထားသောသူသည် မေတ္တာကို ပြုစု၏။ ကြားပြောသောသူမူကား၊ မိတ်ဆွေတို့ကို ကွဲပြားစေ၏။",
  },
  {
    no: 128,
    verse: "သုတ္တံ 22:4",
    title:
      "စိတ်နှိမ့်ချခြင်း၊ ထာဝရဘုရားကို ကြောက်ရွံ့ခြင်းကျေးဇူးကြောင့် စည်းစိမ်၊ ဂုဏ်အသရေ၊ အသက်ကို ရတတ်၏။",
  },
  {
    no: 129,
    verse: "သုတ္တံ 15:23",
    title:
      "လူသည် ပြန်ပြောသောစကားအားဖြင့် ဝမ်းမြောက်စရာအကြောင်းရှိ၏။ အချိန်တန်၍ ပြောသောစကားသည်လည်း အလွန်လျောက်ပတ်ပေ၏။",
  },
  {
    no: 130,
    verse: "သုတ္တံ 14:22",
    title:
      "မကောင်းသောအကြံကို ကြံတတ်သောသူတို့သည် မှားယွင်းကြလိမ့်မည်။ ကျေးဇူးပြုမည်ဟု ကြံတတ်သောသူတို့မူကား၊ ကရုဏာအကျိုးနှင့် သစ္စာအကျိုးကိုခံရကြလိမ့်မည်။",
  },
  {
    no: 131,
    verse: "သုတ္တံ 11:27(က)",
    title: "ကောင်းသောအရာကို ကြိုးစား၍ရှာသောသူသည် ကျေးဇူးကိုခံရလိမ့်မည်။",
  },
  {
    no: 132,
    verse: "သုတ္တံ 14:18",
    title:
      "ဉာဏ်တိမ်သောသူသည် မိုက်ခြင်းကို အမွေခံတတ်၏။ ပညာသတိရှိသောသူမူကား၊ သိပ္ပံသရဖူကို ဆောင်းတတ်၏။",
  },
  {
    no: 133,
    verse: "သုတ္တံ 8:21",
    title:
      "ငါ့ကိုချစ်သောသူတို့သည် အမွေခံရသော အခွင့်နှင့်၊ သူတို့ဘဏ္ဍာတိုက် ပြည့်ဝစေသော အခွင့်ကို ငါပေးတတ်၏။",
  },
  {
    no: 134,
    verse: "သုတ္တံ 4:26",
    title: "သင်သွားရာလမ်းကို စူးစမ်း၍၊ သွားလေရာရာ၌ တည်ကြည်ခြင်းရှိစေလော့။",
  },
  {
    no: 135,
    verse: "သုတ္တံ 6:9",
    title:
      "အိုလူပျင်း၊ သင်သည် အဘယ်မျှကာလပတ်လုံးအိပ်လျက် နေလိမ့်မည်နည်း။ အဘယ်သောအခါ နိုးလိမ့်မည်နည်း။",
  },
  {
    no: 136,
    verse: "ဆာလံ 41:1",
    title:
      "ဆင်းရဲသောသူကို အောက်မေ့သောသူသည် မင်္ဂလာရှိ၏။ ခဲယဉ်းသောကာလ၌ ထိုသူကို ထာဝရဘုရား ကယ်နုတ်တော်မူမည်။",
  },
  {
    no: 137,
    verse: "သုတ္တံ 3:27",
    title:
      "ကျေးဇူးကိုခံသင့်သောသူတို့အား ကျေးဇူးပြုရသောအခွင့်ရှိလျှင် မပြုဘဲမနေနှင့်။",
  },
  {
    no: 138,
    verse: "ဆာလံ 37:5",
    title:
      "ကိုယ်အမှုအရာကို ထာဝရဘုရား၌ အပ်လော့။ ကိုယ်တော်ကို ကိုးစားလော့။ သို့ပြုလျှင် စီရင်တော်မူမည်။",
  },
  {
    no: 139,
    verse: "ဆာလံ 34:5",
    title:
      "ထာဝရဘုရားကို မျှော်ကြည့်ကြလော့။ အလင်းကိုရကြလိမ့်မည်။ မျက်နှာရှက်ကြောက်ခြင်းနှင့် ကင်းလွတ်ကြလိမ့်မည်။",
  },
  {
    no: 140,
    verse: "ဆာလံ 34:14",
    title:
      "ဒုစရိုက်ကိုလွှဲရှောင်၍ သုစရိုက်ကိုပြုလော့။ သူတစ်ပါးနှင့် အသင့်အတင့်နေခြင်းကိုရှာ၍ မီအောင်လိုက်လော့။",
  },
  {
    no: 141,
    verse: "ဆာလံ 25:12",
    title:
      "အကြင်သူသည် ထာဝရဘုရားကို ကြောက်ရွံ့တတ်၏။ ထိုသူအား နှစ်သက်ဖွယ်သောလမ်းကို ပြညွှန်တော်မူမည်။",
  },
  {
    no: 142,
    verse: "ဆာလံ 34:13",
    title:
      "ကိုယ်လျှာကို မကောင်းသောအရာနှင့် ကင်းစေလော့။ နှုတ်ခမ်းလည်း မုသားစကားကို မပြောစေနှင့်။",
  },
  {
    no: 143,
    verse: "ယောဘ 36:11",
    title:
      "စကားတော်ကိုနားထောင်၍ အမှုတော်ကိုဆောင်ရွက်လျှင်၊ စည်းစိမ်ချမ်းသာနှင့် ပျော်မွေ့လျက်၊ နှစ်လနေ့ရက်ကာလကို လွန်စေတတ်ကြ၏။",
  },
  {
    no: 144,
    verse: "ဆာလံ 32:8",
    title:
      "သင့်ကို ငါသွန်သင်မည်။ သင်သွားရမည့်လမ်းကိုပြညွှန်မည်။ သင့်ကို ကြည့်ရှုပြုစုမည်။ ဉာဏ်ပညာမဲ့သော မြင်းလားကဲ့သို့ မဖြစ်နှင့်။",
  },
  {
    no: 145,
    verse: "ဟေရှာယ 55:8",
    title:
      "ထာဝရဘုရား မိန့်တော်မူသည်ကား၊ ငါ၏အကြံအစည်သည် သင်တို့၏ အကြံအစည်နှင့်မတူ။ ငါ၏အကျင့်သည်လည်း သင်တို့၏ အကျင့်နှင့်မတူ။",
  },
  {
    no: 146,
    verse: "ဟေရှာယ 55:11",
    title:
      "ထိုအတူ ငါ၏နှုတ်ကပတ်စကားသည် ဖြစ်လိမ့်မည်။ အကျိုးမရှိဘဲ ငါ့ထံသို့မပြန်ရ။ ငါ့အလိုကို ပြည့်စုံစေမည်။ ငါစေခိုင်းသောအမှု၌ အောင်လိမ့်မည်။",
  },
  {
    no: 147,
    verse: "ယေရမိ 3:15",
    title:
      "ငါသည် နှစ်သက်သောသူတို့ကို သင်းအုပ်အရာ၌ ခန့်ထား၍၊ သူတို့သည် ဉာဏ်ပညာနှင့် ပြည့်စုံလျက် သင်တို့ကို အုပ်ကြလိမ့်မည်။",
  },
  {
    no: 148,
    verse: "ဟေရှာယ 54:5",
    title:
      "အကြောင်းမူကား၊ သင့်ကို ဖန်ဆင်းသောသူသည် သင်၏လင် ဖြစ်တော်မူ၏။ နာမတော်ကား၊ ကောင်းကင်ဗိုလ်ခြေအရှင် ထာဝရဘုရားတည်း။ သင့်ကိုရွေးနုတ်သောသူသည် ဣသရေလအမျိုး၌ သန့်ရှင်းသောဘုရား ဖြစ်တော်မူ၏။ မြေကြီးတစ်ပြင်လုံးကို အစိုးရသောဘုရားဟူ၍ ခေါ်ရကြ၏။",
  },
  {
    no: 149,
    verse: "ဟေရှာယ 12:4",
    title:
      "ထိုကာလ၌လည်း ထာဝရဘုရား၏ဂုဏ်တော်ကို ချီးမွမ်းကြလော့။ နာမတော်ကို ပတ္ထနာပြုကြလော့။ အမှုတော်တို့ကို လူများတို့တွင် ဖော်ပြကြလော့။ နာမတော်သည်မြင့်မြတ်သောကြောင့် ချီးမွမ်းကြလော့။",
  },
  {
    no: 150,
    verse: "ဟေရှာယ 30:18",
    title:
      "သို့သော်လည်း၊ ထာဝရဘုရားသည် သင်တို့၌ ကျေးဇူးပြုလိုသောငှာ မျှော်လင့်တော်မူမည်။ ကရုဏာပြုလိုသောငှာ ချီးမြှောက်ခြင်းကို ခံတော်မူမည်။ အကြောင်းမူကား၊ ထာဝရဘုရားသည် တရားသောဘုရားသခင် ဖြစ်တော်မူ၏။ ကိုယ်တော်ကို မျှော်လင့်သောသူ အပေါင်းတို့သည် မင်္ဂလာရှိကြ၏။",
  },
];

const VersePage = () => {
  const { verseId } = useParams<{ verseId: string }>();
  return (
    <div
      className=" h-screen   text-white "
      style={{
        backgroundImage: `url(/bg-img.jpg)`,
        backgroundRepeat: "no-repeat",
        backgroundSize: "cover",
        backgroundPosition: "center center",
      }}
    >
      <div className="flex justify-center">
        <Image
          className="w-32 h-32"
          src={"/logo.png"}
          alt="logo"
          width={150}
          height={150}
        ></Image>
      </div>
      <p className=" leading-12 text-3xl font-bold text-center m-3">
        ချန်ပီယံများကို မွေးထုတ်ပေးသောနှစ်
      </p>

      <div className="flex items-center justify-center  flex-col gap-6 p-6">
        {/* <p className="text-center text-2xl">{verses.find((v) => v.no === parseInt(verseId))?.title}</p> */}
        <p className="text-2xl text-center  max-w-[500px] flex flex-wrap justify-center">
          "{verses.find((v) => v.no === parseInt(verseId))?.title.split(" ").map(t => <span className=" text-nowrap">{t}{" "}</span>)}"
        </p>
        <p className="italic">
          {verses.find((v) => v.no === parseInt(verseId))?.verse}
        </p>
      </div>
      <p className="absolute bottom-0  w-full text-end text-[10px] p-3">
        Created with ❤️ by{" "}
        <Link href={"https://thiha.net"} target="_blank" className="underline">
          James
        </Link>
      </p>
    </div>
  );
};

export default VersePage;
